Конфигурация/InformationRegisters/СобытияАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияАналитики</Name>
			<Comment>Лог событий пользователей для построения аналитических отчетов.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Comment>Уникальный ключ записи - разводит события с одинаковыми период/пользователь/тема/тип в пределах одной секунды.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/CommonModules/АналитикаПрогресса/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует событие в регистре сведений СобытияАналитики.
//
// Параметры:
//  Пользователь    - Строка       - ФИО обучающегося.
//  Тема            - СправочникСсылка.Темы - тема события (может быть Неопределено).
//  ТипСобытия      - ПеречислениеСсылка.ТипыСобытийАналитики - тип события.
//  ПолезнаяНагрузка - Произвольный - дополнительные данные события (сериализуются в JSON).
//  ИсточникСсылка  - ЛюбаяСсылка   - объект-источник события (может быть Неопределено).
//
Процедура ЗарегистрироватьСобытие(Знач Пользователь, Знач Тема, Знач ТипСобытия,
                                   Знач ПолезнаяНагрузка = Неопределено,
                                   Знач ИсточникСсылка = Неопределено) Экспорт
    
    Попытка
        НаборЗаписей = РегистрыСведений.СобытияАналитики.СоздатьНаборЗаписей();
        Запись = НаборЗаписей.Добавить();
        Запись.Период          = ТекущаяДатаСеанса();
        Запись.Пользователь    = Пользователь;
        Запись.Тема            = Тема;
        Запись.ТипСобытия      = ТипСобытия;
        // Уникальный ключ - иначе несколько событий с одинаковыми
        // период/пользователь/тема/тип в одну секунду дают конфликт ключа.
        Запись.КлючСобытия     = Строка(Новый УникальныйИдентификатор());
        Если ПолезнаяНагрузка = Неопределено Тогда
            Запись.ПолезнаяНагрузка = "{}";
        Иначе
            Запись.ПолезнаяНагрузка = ОбщегоНазначенияСерверПриложение.СериализоватьВJSON(ПолезнаяНагрузка);
        КонецЕсли;
        Запись.ИсточникСсылка  = ИсточникСсылка;
		
		НаборЗаписей.Записать(Ложь);
    Исключение
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "АналитикаПрогресса.ЗарегистрироватьСобытие", ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

// Возвращает агрегаты по событиям пользователя за период (для отчётов СКД).
//
// Параметры:
//  Пользователь  - Строка - ФИО обучающегося.
//  ДатаНачала    - Дата   - начало периода.
//  ДатаОкончания - Дата   - конец периода.
//
// Возвращаемое значение:
//  Соответствие - ПеречислениеСсылка.ТипыСобытийАналитики -> Число (количество событий).
//
Функция ПолучитьАгрегатыПоПериоду(Знач Пользователь, Знач ДатаНачала, Знач ДатаОкончания) Экспорт
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   СА.ТипСобытия     КАК Тип,
        |   КОЛИЧЕСТВО(*)     КАК Кол
        |ИЗ РегистрСведений.СобытияАналитики КАК СА
        |ГДЕ СА.Пользователь = &Пользователь И СА.Период МЕЖДУ &Начало И &Окончание
        |СГРУППИРОВАТЬ ПО СА.ТипСобытия");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Начало",       ДатаНачала);
    Запрос.УстановитьПараметр("Окончание",    ДатаОкончания);
    
    Результат = Новый Соответствие;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Вставить(Выборка.Тип, Выборка.Кол);
    КонецЦикла;
    Возврат Результат;
    
КонецФункции

#КонецОбласти
